Tekla.Structures.Drawing.CloudBase
The CloudBase class is an abstract base class for all cloud objects
(the cloud and the rectangular cloud).

Tekla.Structures.Drawing.CloudBase.Bulge
The bulge (curve) to use (a bulge is the ratio between the height and width of an object).

Tekla.Structures.Drawing.CloudBase.ArcWidth
The arc width to use for the cloud base.
The property usage follows the below legacy cloud creation rules.
In case of positive value then that value will be used.
In case of zero value then the positive value of the XS_ARC_WIDTH_OF_CLOUD advance option is used
and in case that also the advance option value is 0 then the default legacy 10 value is used.
In case of negative value the value is transformed and its positive value is used.

Tekla.Structures.Drawing.CloudBase.#ctor
Creates a new cloud base instance.